#!/usr/local/bin/python3.5
# -*- coding: utf-8 -*-

# Created By GeniusV at 201707292333

import random


class Factory:
    def get(self):
        pass


class NameFactory(Factory):
    def __init__(self):
        pass

    def get(self):
        first = [
            '王', '李', '张', '刘', '陈', '杨', '黄', '吴', '赵', '周',
            '徐', '孙', '马', '朱', '胡', '林', '郭', '何', '高', '罗',
            '郑', '梁', '谢', '宋', '唐', '许', '邓', '冯', '韩', '曹',
            '曾', '彭', '萧', '蔡', '潘', '田', '董', '袁', '于', '余',
            '叶', '蒋', '杜', '苏', '魏', '程', '吕', '丁', '沈', '任',
            '姚', '卢', '傅', '钟', '姜', '崔', '谭', '廖', '范', '汪',
            '陆', '金', '石', '戴', '贾', '韦', '夏', '邱', '方', '侯',
            '邹', '熊', '孟', '秦', '白', '江', '阎', '薛', '尹', '段',
            '雷', '黎', '史', '龙', '陶', '贺', '顾', '毛', '郝', '龚',
            '邵', '万', '钱', '严', '赖', '覃', '洪', '武', '莫', '孔',
            '汤', '向', '常', '温', '康', '施', '文', '牛', '樊', '葛',
            '邢', '安', '齐', '易', '乔', '伍', '庞', '颜', '倪', '庄',
            '聂', '章', '鲁', '岳', '翟', '殷', '詹', '申', '欧', '耿',
            '关', '兰', '焦', '俞', '左', '柳', '甘', '祝', '包', '宁',
            '尚', '符', '舒', '阮', '柯', '纪', '梅', '童', '凌', '毕',
            '单', '季', '裴', '霍', '涂', '成', '苗', '谷', '盛', '曲',
            '翁', '冉', '骆', '蓝', '路', '游', '辛', '靳', '欧阳', '管',
            '柴', '蒙', '鲍', '华', '喻', '祁', '蒲', '房', '滕', '屈',
            '饶', '解', '牟', '艾', '尤', '阳', '时', '穆', '农', '司',
            '卓', '古', '吉', '缪', '简', '车', '项', '连', '芦', '麦',
            '褚', '娄', '窦', '戚', '岑', '景', '党', '宫', '费', '卜',
            '冷', '晏', '席', '卫', '米', '柏', '宗', '瞿', '桂', '全',
            '佟', '应', '臧', '闵', '苟', '邬', '边', '卞', '姬', '师',
            '和', '仇', '栾', '隋', '商', '刁', '沙', '荣', '巫', '寇',
            '桑', '郎', '甄', '丛', '仲', '虞', '敖', '巩', '明', '佘',
            '池', '查', '麻', '苑', '迟', '邝', '官', '封', '谈', '匡',
            '鞠', '惠', '荆', '乐', '冀', '郁', '胥', '南', '班', '储',
            '原', '栗', '燕', '楚', '鄢', '劳', '谌', '奚', '皮', '粟',
            '冼', '蔺', '楼', '盘', '满', '闻', '位', '厉', '伊', '仝',
            '区', '郜', '海', '阚', '花', '权', '强', '帅', '屠', '豆',
            '朴', '盖', '练', '廉', '禹', '井', '祖', '漆', '巴', '丰',
            '支', '卿', '国', '狄', '平', '计', '索', '宣', '晋', '相',
            '初', '门', '雲', '容', '敬', '来', '扈', '晁', '芮', '都',
            '普', '阙', '浦', '戈', '伏', '鹿', '薄', '邸', '雍', '辜',
            '羊', '阿', '乌', '母', '裘', '亓', '修', '邰', '赫', '杭',
            '况', '那', '宿', '鲜', '印', '逯', '隆', '茹', '诸', '战',
            '慕', '危', '玉', '银', '亢', '嵇', '公', '哈', '湛', '宾',
            '戎', '勾', '茅', '利', '於', '呼', '居', '揭', '干', '但',
            '尉', '冶', '斯', '元', '束', '檀', '衣', '信', '展', '阴',
            '昝', '智', '幸', '奉', '植', '衡', '富', '尧', '闭', '由'
        ]
        last = [
            '弈欣', '铭玟', '振洲', '玟铭', '金霞', '俞乐', '沛娴', '佳雪',
            '科峰', '先美', '曼菲', '亚飞', '修齐', '修宁', '修铭', '昱杉',
            '禧龙', '修宇', '镜豆', '嘉萱', '守钧', '二睿', '三睿', '灵睿',
            '邦理', '永琪', '仲虹', '仲红', '月文', '益铭', '屹铭', '小丹',
            '剑锋', '曼飞', '志虎', '家乐', '祖荣', '诗佳', '莫非', '伟奇',
            '志辉', '嘉韵', '乐斌', '雪佳', '德铭', '智虎', '治宽', '才先',
            '友聪', '少戈', '少彤', '少萱', '佳仪', '茜诺', '宇铭', '墨翰',
            '铭宇', '锦恺', '梓君', '元武', '生辉', '锦楷', '铭舜', '亿铭',
            '宇宣', '锦灿', '鱼童', '靖茹', '垚羽', '乐渔', '宇煊', '知渔',
            '志平', '知鱼', '晓英', '纪充', '一昌', '美思', '思希', '东周',
            '达道', '茜雯', '美麒', '悦婷', '妙绮', '剀漩', '嘉绮', '洪贞',
            '浏良', '文俊', '渔童', '桐汉', '旺祖', '玉琴', '军锋', '均严',
            '渔乐', '映霞', '裕洪', '材懿', '照东', '稼林', '润强', '会升',
            '宜驿', '谋发', '锦粲', '锦林', '敬旭', '酌琳', '婧怡', '波旭',
            '铭昊', '梓扬', '皓铭', '睿明', '国胜', '依欣', '晓愚', '乃明',
            '柔廷', '健雅', '梅欣', '小钢', '瑜怡', '秀华', '希茂', '迪明',
            '金美', '锦奕', '恩雅', '奕材', '悦佳', '创时', '宝熙', '勇昆',
            '垃圾', '星朋', '珺昱', '浚衍', '峻松', '俊衍', '浚焱', '亦铭',
            '钦渔', '楚娟', '眉嘉', '可儿', '丰珍', '俊俨', '汉熙', '维维',
            '好渔', '光吉', '新远', '瑛瑛', '志佳', '俊源', '义铭', '东航',
            '冰巧', '之槐', '香柳', '问春', '夏寒', '半香', '诗筠', '新梅', '白曼', '安波', '从阳', '含桃', '曼卉', '笑萍', '碧巧', '晓露', '寻菡', '沛白',
            '平灵', '水彤', '安彤', '涵易', '乐巧', '依风', '紫南', '亦丝', '易蓉', '紫萍', '惜萱', '诗蕾', '寻绿', '诗双', '寻云', '孤丹', '谷蓝', '惜香',
            '谷枫', '山灵', '幻丝', '友梅', '从云', '雁丝', '盼旋', '幼旋', '尔蓝', '沛山', '代丝', '痴梅', '觅松', '冰香', '依玉', '冰之', '妙梦', '以冬',
            '碧春', '曼青', '冷菱', '雪曼', '安白', '香桃', '安春', '千亦', '凌蝶', '又夏', '南烟。靖易', '沛凝', '翠梅', '书文', '雪卉', '乐儿', '傲丝',
            '安青',
            '初蝶', '寄灵', '惜寒', '雨竹', '冬莲', '绮南', '翠柏', '平凡', '亦玉', '孤兰', '秋珊', '新筠', '半芹', '夏瑶', '念文', '晓丝', '涵蕾', '雁凡',
            '谷兰', '灵凡', '凝云', '曼云', '丹彤', '南霜', '夜梦', '从筠', '雁芙', '语蝶', '依波', '晓旋', '念之', '盼芙', '曼安', '采珊', '盼夏', '初柳',
            '迎天', '曼安', '南珍', '妙芙', '语柳', '含莲', '晓筠', '夏山', '尔容', '采春', '念梦', '傲南', '问薇', '雨灵', '凝安', '冰海', '初珍', '宛菡',
            '冬卉', '盼晴', '冷荷', '寄翠', '幻梅', '如凡', '语梦', '易梦', '千柔', '向露', '梦玉', '傲霜', '依霜', '灵松', '诗桃', '书蝶', '恨真', '冰蝶',
            '山槐', '以晴', '友易', '梦桃', '香菱', '孤云', '水蓉', '雅容', '飞烟', '雁荷', '代芙', '醉易', '夏烟', '山梅', '若南', '恨桃', '依秋', '依波',
            '香巧', '紫萱', '涵易', '忆之', '幻巧', '水风', '安寒', '白亦', '惜玉', '碧春', '怜雪', '听南', '念蕾', '梦竹', '千凡', '寄琴', '采波', '元冬',
            '思菱', '平卉', '笑柳', '雪卉', '南蓉', '谷梦', '巧兰', '绿蝶', '飞荷', '平安', '孤晴', '芷荷', '曼冬', '寻巧', '寄波', '尔槐', '以旋', '绿蕊',
            '初夏', '依丝', '怜南', '千山', '雨安', '水风', '寄柔', '念巧', '幼枫', '凡桃', '新儿', '春翠', '夏波', '雨琴', '静槐', '元槐', '映阳', '飞薇',
            '小凝', '映寒', '傲菡', '谷蕊', '笑槐', '飞兰', '笑卉', '迎荷', '元冬', '书竹', '半烟', '绮波', '小之', '觅露', '夜雪', '春柔', '寒梦', '尔风',
            '白梅', '雨旋', '芷珊', '山彤', '尔柳', '沛柔', '灵萱', '沛凝', '白容', '乐蓉', '映安', '依云', '映冬', '凡雁', '梦秋', '醉柳', '梦凡', '秋巧',
            '若云', '元容', '怀蕾', '灵寒', '天薇', '白风', '访波', '亦凝', '易绿', '夜南', '曼凡', '亦巧', '青易', '冰真', '白萱', '友安', '诗翠', '雪珍',
            '海之',
            '小蕊', '又琴', '香彤', '语梦', '惜蕊', '迎彤', '沛白', '雁山', '易蓉', '雪晴', '诗珊', '春冬', '又绿', '冰绿', '半梅', '笑容', '沛凝', '念瑶',
            '天真', '含巧', '如冬', '向真', '从蓉', '春柔', '亦云', '向雁', '尔蝶', '冬易', '丹亦', '夏山', '醉香', '盼夏', '孤菱', '安莲', '问凝', '冬萱',
            '晓山', '雁蓉', '梦蕊', '山菡', '南莲', '飞双', '凝丝', '思萱', '怀梦', '雨梅', '冷霜', '向松', '迎丝', '迎梅', '听双', '山蝶', '夜梅', '醉冬',
            '巧云', '雨筠', '平文', '青文', '半蕾', '幼菱', '寻梅', '含之', '香之', '含蕊', '亦玉', '靖荷'
        ]
        return random.choice(first) + random.choice(last)



class PhoneNumFactory(Factory):
    __head = [134, 135, 136, 137, 138, 139, 147, 150, 151, 152, 157, 158, 159, 187, 188,
              130, 131, 132, 155, 156, 185, 186,
              133, 153, 180, 189]

    def get(self):
        list = []
        for i in range(8):
            list.append(str(random.randint(0, 9)))
        return str(random.choice(self.__head)) + str(''.join(list))


class AddressFactory(Factory):
    __city = [
        '郑州市', '洛阳市', '焦作市', '商丘市', '信阳市', '周口市', '鹤壁市', '安阳市', '濮阳市', '驻马店市',
        '南阳市', '开封市漯河市', '许昌市', '新乡市', '济源市',
        '灵宝市', '偃师市', '邓州市', '登封市', '三门峡市',
        '新郑市', '禹州市', '巩义市', '永城市', '长葛市', '义马市', '林州市', '项城市', '汝州市', '荥阳市',
        '平顶山市', '卫辉市', '辉县市', '舞钢市', '新密市', '孟州市', '沁阳市', '郏县',
        '合肥市', '亳州市', '芜湖市', '马鞍山市', '池州市', '黄山市', '滁州市', '安庆市',
        '淮南市', '淮北市', '蚌埠市', '宿州市', '宣城市', '六安市', '阜阳市',
        '铜陵市明光市', '天长市', '宁国市', '界首市', '桐城市',
        '福州市', '厦门市', '泉州市', '漳州市', '南平市', '三明市', '龙岩市', '莆田市',
        '宁德市', '建瓯市', '武夷山市', '长乐市', '福清市', '晋江市', '南安市', '福安市',
        '龙海市', '邵武市', '石狮市', '福鼎市', '建阳市', '漳平市', '永安市',
        '兰州市', '白银市', '武威市', '金昌市', '平凉市', '张掖市', '嘉峪关市', '酒泉市',
        '庆阳市', '定西市', '陇南市', '天水市', '玉门市', '临夏市', '合作市', '敦煌市', '甘南州',
        '贵阳市', '安顺市', '遵义市', '六盘水市', '兴义市', '都匀市', '凯里市', '毕节市', '清镇市',
        '铜仁市', '赤水市', '仁怀市', '福泉市',
        '海口市', '三亚市', '万宁市', '文昌市', '儋州市', '琼海市', '东方市', '五指山市',
        '石家庄市', '保定市', '唐山市', '邯郸市邢台市', '沧州市', '衡水市', '廊坊市', '承德市', '迁安市',
        '鹿泉市', '秦皇岛市', '南宫市', '任丘市', '叶城市', '辛集市', '涿州市', '定州市', '晋州市', '霸州市',
        '黄骅市', '遵化市', '张家口市', '沙河市', '三河市', '冀州市', '武安市', '河间市', '深州市', '新乐市',
        '泊头市', '安国市', '双滦区', '高碑店市',
        '哈尔滨市', '伊春市', '牡丹江市', '大庆市', '鸡西市', '鹤岗市', '绥化市', '齐齐哈尔市',
        '黑河市', '富锦市', '虎林市', '密山市', '佳木斯市', '双鸭山市', '海林市', '铁力市', '北安市',
        '五大连池市', '阿城市', '尚志市', '五常市', '安达市', '七台河市', '绥芬河市', '双城市',
        '海伦市', '宁安市', '讷河市', '穆棱市', '同江市', '肇东市',
        '武汉市', '荆门市', '咸宁市', '襄阳市', '荆州市', '黄石市', '宜昌市', '随州市',
        '鄂州市', '孝感市', '黄冈市', '十堰市', '枣阳市', '老河口市', '恩施市', '仙桃市',
        '天门市', '钟祥市', '潜江市', '麻城市', '洪湖市', '汉川市', '赤壁市', '松滋市',
        '丹江口市', '武穴市', '广水市', '石首市大冶市', '枝江市', '应城市', '宜城市',
        '当阳市', '安陆市', '宜都市', '利川市',
        '长沙市', '郴州市', '益阳市', '娄底市', '株洲市', '衡阳市', '湘潭市',
        '岳阳市', '常德市', '邵阳市', '永州市', '张家界市', '怀化市', '浏阳市',
        '醴陵市', '湘乡市', '耒阳市', '沅江市', '涟源市', '常宁市', '吉首市',
        '津市市', '冷水江市', '临湘市', '汨罗市', '武冈市', '韶山市', '湘西州',
        '长春市', '吉林市', '通化市', '白城市', '四平市', '辽源市', '松原市', '白山市',
        '集安市', '梅河口市', '双辽市', '延吉市', '九台市', '桦甸市', '榆树市', '蛟河市',
        '磐石市', '大安市', '德惠市', '洮南市', '龙井市', '珲春市', '公主岭市', '图们市',
        '舒兰市', '和龙市', '临江市', '敦化市',
        '南京市', '无锡市', '常州市', '扬州市', '徐州市', '苏州市', '连云港市', '盐城市',
        '淮安市', '宿迁市', '镇江市', '南通市', '泰州市', '兴化市', '东台市', '常熟市',
        '江阴市', '张家港市', '通州市', '宜兴市', '邳州市', '海门市', '溧阳市', '泰兴市',
        '如市', '昆山市', '启东市', '江都市', '丹阳市', '吴江市', '靖江市', '扬中市',
        '新沂市', '仪征市', '太仓市', '姜堰市', '高邮市', '金坛市', '句容市', '灌南县',
        '南昌市', '赣州市', '上饶市', '宜春市', '景德镇市', '新余市', '九江市', '萍乡市',
        '抚州市', '鹰潭市', '吉安市', '丰城市', '樟树市', '德兴市', '瑞金市', '井冈山市',
        '高安市', '乐平市', '南康市', '贵溪市', '瑞昌市', '东乡县', '广丰县', '信州区', '三清山',
        '沈阳市', '葫芦岛市', '大连市', '盘锦市', '鞍山市', '铁岭市', '本溪市', '丹东市',
        '抚顺市', '锦州市', '辽阳市', '阜新市', '调兵山市', '朝阳市', '海城市', '北票市',
        '盖州市', '凤城市', '庄河市', '凌源市', '开原市', '兴城市', '新民市', '大石桥市',
        '东港市', '北宁市', '瓦房店市', '普兰店市', '凌海市', '灯塔市', '营口市',
        '西宁市', '格尔木市', '德令哈市',
        '济南市', '青岛市', '威海市', '潍坊市', '菏泽市', '济宁市', '莱芜市', '东营市',
        '烟台市', '淄博市', '枣庄市', '泰安市', '临沂市', '日照市', '德州市', '聊城市',
        '滨州市', '乐陵市', '兖州市', '诸城市', '邹城市', '滕州市', '肥城市', '新泰市',
        '胶州市', '胶南市', '即墨市', '龙口市', '平度市', '莱西市',
        '太原市', '大同市', '阳泉市', '长治市', '临汾市', '晋中市', '运城市', '忻州',
        '朔州市', '吕梁市', '古交市', '高平市', '永济市', '孝义市', '侯马市', '霍州市',
        '介休市', '河津市', '汾阳市', '原平市', '潞城市',
        '西安市', '咸阳市', '榆林市', '宝鸡市', '铜川市', '渭南市', '汉中市', '安康市',
        '商洛市', '延安市', '韩城市', '兴平市', '华阴市',
        '成都市', '广安市', '德阳市', '乐山市', '巴中市', '内江市', '宜宾市', '南充市',
        '都江堰市', '自贡市', '泸州市', '广元市', '达州市', '资阳市', '绵阳市', '眉山市',
        '遂宁市', '雅安市', '阆中市', '攀枝花市', '广汉市', '绵竹市', '万源市', '华蓥市',
        '江油市', '西昌市', '彭州市', '简阳市', '崇州市', '什邡市', '峨眉山市', '邛崃市',
        '昆明市', '玉溪市', '大理市', '曲靖市', '昭通市', '保山市', '丽江市', '临沧市', '楚雄市',
        '开远市', '个旧市', '景洪市', '安宁市', '宣威市',
        '杭州市', '宁波市', '绍兴市', '温州市', '台州市', '湖州市', '嘉兴市', '金华市', '舟山市',
        '衢州市', '丽水市', '余姚市', '乐清市', '临海市', '温岭市', '永康市', '瑞安市', '慈溪市',
        '义乌市', '上虞市', '诸暨市', '海宁市', '桐乡市', '兰溪市', '龙泉市', '建德市', '富德市',
        '富阳市', '平湖市', '东阳市', '嵊州市', '奉化市', '临安市', '江山市',
        '台北市', '台南市', '台中市', '高雄市', '桃源市',
        '广州市', '深圳市珠海市', '汕头市', '佛山市', '韶关市', '湛江市', '肇庆市', '江门市',
        '茂名市', '惠州市', '梅州市', '汕尾市', '河源市', '阳江市', '清远市', '东莞市',
        '中山市', '潮州市', '揭阳市', '云浮'
    ]
    __road = [
        '澳门路', '北京东路', '北京西路', '北海路', '北苏州路', '宝山路', '宝杨路', '白杨路', '崇明支路', '常熟路', '昌化路', '昌平路', '曹杨路', '蔡伦路', '赤峰路',
        '长柳路', '丁香路', '东大名路', '东横浜路', '冬融路', '多伦路', '大连路', '杜鹃路 ', '滇池路', '峨嵋路', '复兴东路', '复兴中路', '复兴西路', '方浜中路', '汾阳路',
        '福佑路', '福州路', '福建中路', '芳甸路', '共和新路', '共和路', '广东路', '广西北路', '港城路', '皋兰路', '高安路', '华山路', '合欢路', '常德路', '汉口路',
        '沪闵路', '河南中路', '河南北路', '河南南路', '海伦西路', '海伦路', '海宁路', '海桐路', '淮海东路', '淮海路', '湖北路', '湖南路', '花木路', '虎丘路', '虹桥路',
        '衡山路', '邯郸路', '铜仁路', '黄河路', '黄浦路', '黄陂北路', '黄陂南路', '九江路', '巨鹿路', '建国中路', '建国西路', '晋元路', '江宁路', '江苏北路', '江苏路',
        '江西中路', '江西北路', '胶州路', '金口路', '金松路', '金陵东路', '锦安西路', '锦绣路', '静安寺路', '康定路', '康平路', '控江路', '昆山花园路', '昆山路', '溧阳路',
        '龙汇路', '龙漕路', '梅花路', '民生路', '茂名北路', '茂名南路', '南京东路', '南京西路', '南昌路', '南车站路', '南阳路', '平凉路', '彭泽路', '浦东南路', '浦建路',
        '七浦路', '前程路', '秋霞路', '虬江路', '人民大道', '人民路', '熱河路', '瑞金一路', '瑞金二路', '上南路', '世纪大道', '四川中路', '四川北路', '四平路', '四方路',
        '山东中路', '山阴路', '思南路', '汕頭路', '石门一路', '石门二路', '绍兴路', '陕西北路', '陕西南路', '塘沽路', '天山路', '天津路', '天潼路', '天目东路', '天目中路',
        '天目西路', '太原路', '头坝路', '甜爱路', '万航渡路', '乌鲁木齐中路', '乌鲁木齐北路', '乌鲁木齐南路', '五原路', '吴淞路', '武夷路', '武康路', '武昌路', '武进路',
        '徐家汇路', '斜土路', '新华路', '新闸路', '翔殷路', '襄阳南路', '西康路', '西藏中路', '西藏北路', '西藏南路', '香山路', '香港路', '云南中路', '余庆路', '友谊路',
        '吴江路', '圆明园路', '岳阳路', '延安东路', '延安中路', '延安西路', '延安路', '杨树浦路', '杨高中路', '杨高南路', '杨高路', '永嘉路', '玉兰路', '迎春路', '雁荡路',
        '中华路', '中山东一路', '中山东二路', '中山南路', '中州路', '乍浦路', '制造局路', '周家嘴路', '张杨路', '枣庄路', '浙江中路', '祖冲之路', '紫槐路', '肇嘉浜路',
        '舟山路', '东安路', '东平路', '东方路'
    ]

    def get(self):
        return random.choice(self.__city) + random.choice(self.__road) + str(random.randint(1, 1000)) + '号'


class DateGenerator:
    __tb_name = ''
    isinstance(__tb_name, str)
    __field = {}
    isinstance(__field, dict)
    __num = 0

    def __init__(self, name, field, num):
        self.__tb_name = name
        self.__field = field
        self.__num = num

    def __convert(self):
        field_name = []
        field_value = []
        for i in self.__field:
            field_name.append(i)
            if isinstance(self.__field[i], Factory):
                field_value.append(self.__field[i].get())
            else:
                field_value.append(self.__field[i])
            if isinstance(field_value[-1], str):
                field_value[-1] = "'" + field_value[-1] + "'"
            else:
                field_value[-1] = str(field_value[-1])
        return field_name, field_value

    def run(self):
        for i in range(self.__num):
            common = ', '
            field_name, field_value = self.__convert()
            print("INSERT INTO {} ({}) VALUES ({});".format(self.__tb_name, common.join(field_name),
                                                            common.join(field_value)))


if __name__ == '__main__':
    name = NameFactory()
    address = AddressFactory()
    phone_num = PhoneNumFactory()

    dico = {'name': name, 'address': address, 'phone': phone_num}
    g = DateGenerator("tablename", dico, 10000)
    g.run()
